<div class="wikidoc">Navigation: <a href="https://installerframework.codeplex.com/wikipage?referringTitle=Home">Home</a> | <a href="https://installerframework.codeplex.com/wikipage?title=Versionen&referringTitle=Home">Versionen</a> | <a href="https://installerframework.codeplex.com/wikipage?title=Dokumentation&referringTitle=Home">Dokumentation</a>
<h1>InstallerFramework v1.0</h1>Das InstallerFramework ist eine Bibliothek, mit der benutzerdefinierte Setups in jeder Programmiersprache erstellt werden k&#246;nnen. Es k&#246;nnen zum Beispiel Dienste, EventLogs und Verkn&#252;pfungen installiert werden.<br />InstallerFramework wurde in C&#35; f&#252;r das .Net Framework 3.5 geschrieben.<br /><br /><b>Inhalt</b><br />1 Vorteile des InstallerFrameworks<br />2 Nutzung des InstallerFrameworks<br />3 &#196;nderungen zur vorherigen Version<br />4 Funktionen des InstallerFrameworks<br />5 Zielstellung f&#252;r die n&#228;chsten Versionen und Bugs<br />6 Autoren<br /><br /><b>1 Vorteile des InstallerFrameworks</b><br />F&#252;r die komfortable Verwendung von Software ist oft eine Installation notwendig, denn sie bietet einige Vorteile f&#252;r die Verwendung des Produkts.<br />Durch Registrierung in der Registry kann die Software bei Bedarf wieder entfernt werden. Au&#223;erdem sind die Installationen von Ereignisprotokollen und Diensten anspruchsvoll, sodass sich die Verwendung einer Installer-Bibliothek lohnt. Fast alle Installer bieten eine grafische Oberfl&#228;che, die auf Stufen aufbaut, um eine logische Abfolge der Einstellungen f&#252;r den Benutzer zu erm&#246;glichen.<br />Viele Hersteller bieten fertige Installer an, die Installationspakete f&#252;r Windows Installer erstellen. Die Konfiguration dieser Installer ist aber nur mit Xml oder &#228;hnlichen deskriptiven Sprachen m&#246;glich, das erfordert das Erlernen einer neuen Programmiersprache oder vieler Xml-Befehlen und Attributen. Au&#223;erdem sind die Einstellungsm&#246;glichkeiten mit Xml oder deskriptiven Sprachen sehr beschr&#228;nkt, sodass anspruchsvolle Setups nicht erstellt werden k&#246;nnen.<br /><br />Eine L&#246;sung bietet das InstallerFramework:<br />Es nutzt das .Net Framework und ist daher relativ plattformunabh&#228;ngig. Die Bibliothek kann mit allen Programmiersprachen, die .Net unterst&#252;tzen, genutzt werden. F&#252;r die Installation muss nur die InstallerFramework.dll-Datei mitgebracht werden. Das InstallerFramework verf&#252;gt &#252;ber eine grafische Oberfl&#228;che und enth&#228;lt viele vordefinierte Installer, die vom Benutzer eingestellt werden k&#246;nnen. Es k&#246;nnen auch eigene, kompatible Installer erstellt werden, indem sie von einer abstrakten Schnittstelle abgeleitet werden.<br /><br /><b>2 Nutzung des InstallerFrameworks</b><br />Das InstallerFramework besteht aus der Datei „InstallerFramework.dll“, die die Installationsroutinen enth&#228;lt. F&#252;r das Erstellen eines Setups kann diese Bibliothek referenziert werden, um die Funktionen in einem Setup-Projekt zu nutzen. Das Setup-Projekt kompiliert eine ausf&#252;hrbare Datei, die eine Installation startet. Dabei muss die „InstallerFramework.dll“-Bibliothek f&#252;r die Installation mitgeliefert werden. Um m&#246;glichst wenige einzelne Dateien mitzubringen, empfiehlt sich das Erstellen eines selbstextrahierenden Archivs.<br />Das InstallerFramework steht unter der MIT-Lizenz, siehe <a href="http://installerframework.codeplex.com/license">http://installerframework.codeplex.com/license</a>.<br /><br /><b>3 &#196;nderungen zur vorherigen Version</b><br />Diese Version hat keine Vorg&#228;ngerversion.<br /><br /><b>4 Funktionen des InstallerFrameworks</b>
<ul><li>der Installer funktioniert mit dem .Net Framework 3.5 und wurde in C# geschrieben</li>
<li>abstrakte Schnittstelle f&#252;r Installer</li>
<li>Installer f&#252;r Registrierungseintr&#228;ge, Ereignisprotokolle, Dateien und Verzeichnisse, Registrierung der Software auf dem System, Dienste, Verkn&#252;pfungen</li>
<li>Installation und Deinstallation werden unterst&#252;tzt</li>
<li>mehrstufige Benutzeroberfl&#228;che</li>
<li>Ermitteln der Fortschrittsstufe der Installation</li>
<li>Finden von installierter Software auf dem System </li>
<li>vollst&#228;ndiger Verzicht auf „Windows Installer“</li>
<li>gute Erweiterbarkeit mit eigenen Komponenten</li>
<li>sehr gute Dokumentation der Frameworks</li>
<li>bestm&#246;gliche Einhaltung der FxCop- und StyleCop-Vorgaben f&#252;r den Programmierstil</li></ul>
Genaueres steht bei den <a href="https://installerframework.codeplex.com/wikipage?title=Versionen&referringTitle=Home">Versionen</a> des InstallerFrameworks.<br /><br /><b>5 Zielstellung f&#252;r die n&#228;chsten Versionen und Bugs</b>
<ul><li>Updates installieren</li>
<li>Abbrechen, Anhalten und Fortsetzen der Installation</li>
<li>Ausf&#252;hrung von Aufgaben beim Neustart (falls z.B zu &#228;ndernde Dateien von System genutzt werden)</li>
<li>Sicherung der Installation in einer tempor&#228;ren Datei (falls das System abst&#252;rzt)</li>
<li>Installer f&#252;r Dateiregistrierung</li>
<li>Komprimieren der zu installierenden Software</li>
<li>Registrierung von Komponenten (Com-Dateien, Global Assembly Cache)</li></ul>
Genaueres steht bei den <a href="https://installerframework.codeplex.com/wikipage?title=Versionen&referringTitle=Home">Versionen</a> des InstallerFrameworks.<br /><br /><b>6 Autoren</b><br />Programmierer und Ver&#246;ffentlicher des InstallerFrameworks: Andreas Becker</div><div class="ClearBoth"></div>